In [4]:
import numpy as np
import pandas as pd
from env import get_db_url

url = get_db_url('employees')

In [6]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [5]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [8]:
employees = pd.read_sql('SELECT * FROM employees LIMIT 10 OFFSET 50', url)

In [7]:
titles = pd.read_sql('SELECT * FROM titles LIMIT 10 OFFSET 50', url)

In [9]:
type(employees)

pandas.core.frame.DataFrame

In [10]:
type(titles)

pandas.core.frame.DataFrame

In [31]:
employees

   emp_no  birth_date first_name    last_name gender   hire_date
0   10051  1953-07-28   Hidefumi        Caine      M  1992-10-15
1   10052  1961-02-26     Heping       Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv     Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi    Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy       Dredge      M  1992-04-27
5   10056  1961-09-01    Brendon      Bernini      F  1990-02-01
6   10057  1954-05-30       Ebbe     Callaway      F  1992-01-15
7   10058  1954-10-01    Berhard     McFarlin      M  1987-04-13
8   10059  1953-09-19  Alejandro     McAlpine      F  1991-06-26
9   10060  1961-10-15   Breannda  Billingsley      M  1987-11-02

In [28]:
employees.shape

(10, 6)

In [32]:
titles

   emp_no            title   from_date     to_date
0   10036     Senior Staff  1992-04-28  9999-01-01
1   10037         Engineer  1990-12-05  1995-12-05
2   10037  Senior Engineer  1995-12-05  9999-01-01
3   10038     Senior Staff  1996-09-20  9999-01-01
4   10038            Staff  1989-09-20  1996-09-20
5   10039     Senior Staff  1997-01-18  9999-01-01
6   10039            Staff  1988-01-19  1997-01-18
7   10040         Engineer  1993-02-14  1999-02-14
8   10040  Senior Engineer  1999-02-14  9999-01-01
9   10041     Senior Staff  1998-11-12  9999-01-01

In [29]:
titles.shape

(10, 4)

In [33]:
#8
employees.describe()

            emp_no
count     10.00000
mean   10055.50000
std        3.02765
min    10051.00000
25%    10053.25000
50%    10055.50000
75%    10057.75000
max    10060.00000

In [34]:
titles.describe()

             emp_no
count     10.000000
mean   10038.500000
std        1.581139
min    10036.000000
25%    10037.250000
50%    10038.500000
75%    10039.750000
max    10041.000000

In [14]:
#9
sql = '''
SELECT DISTINCT title FROM titles;
'''
unique_titles = pd.read_sql(sql, url)
unique_titles

                title
0     Senior Engineer
1               Staff
2            Engineer
3        Senior Staff
4  Assistant Engineer
5    Technique Leader
6             Manager

In [60]:
#10
pd.read_sql('SELECT min(to_date) as oldest_date FROM titles LIMIT 1', get_db_url)

  oldest_date
0  1985-03-01

In [69]:
#11


pd.read_sql('SELECT max(to_date) FROM titles LIMIT 1 WHERE NOT to_date LIKE '9999%', get_db_url)

SyntaxError: invalid syntax (1396795186.py, line 4)